Repository: akhmialeuski/telegram_myweeks_life_bot
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: ru

# help.text
source: 🤖 LifeWeeksBot - Helps you track the weeks of your life 📋 Available commands: • /start - Registration and settings • /weeks - Show life weeks • /visualize - Visualize life weeks • /settings - Settings • /subscription - Subscription • /help - This help 💡 Fun facts: • There are 52 weeks in a year • Average life expectancy: 80 years • That's about 4,160 weeks 🎯 The goal of the bot is to help you realize the value of time!
ru: 🤖 LifeWeeksBot - Помогает отслеживать недели твоей жизни 📋 Доступные команды: • /start - Регистрация и настройка • /weeks - Показать недели жизни • /visualize - Визуализация недель жизни • /settings - Настройки • /subscription - Подписка • /help - Эта справка 💡 Интересные факты: • В году 52 недели • Средняя продолжительность жизни: 80 лет • Это примерно 4,160 недель 🎯 Цель бота - помочь тебе осознать ценность времени!

# start.welcome_existing
source: 👋 Hello, %(first_name)s! Welcome back to LifeWeeksBot! You are already registered and ready to track your life weeks. Use /weeks to view your life weeks. Use /help for help.
ru: 👋 Привет, %(first_name)s! Добро пожаловать обратно в LifeWeeksBot! Ты уже зарегистрирован и готов отслеживать недели своей жизни. Используй /weeks чтобы посмотреть недели жизни. Используй /help для справки.

# start.welcome_new
source: 👋 Hello, %(first_name)s! Welcome to LifeWeeksBot! This bot will help you track the weeks of your life. 📅 Please enter your birth date in DD.MM.YYYY format For example: 15.03.1990
ru: 👋 Привет, %(first_name)s! Добро пожаловать в LifeWeeksBot! Этот бот поможет тебе отслеживать недели твоей жизни. 📅 Пожалуйста, введи дату рождения в формате ДД.ММ.ГГГГ Например: 15.03.1990

# registration.success
source: ✅ Great! You have successfully registered! 📅 Birth date: %(birth_date)s 🎂 Age: %(age)s years 📊 Weeks lived: %(weeks_lived)s ⏳ Remaining weeks: %(remaining_weeks)s 📈 Life progress: %(life_percentage)s Now you can use commands: • /weeks - show life weeks • /visualize - visualize weeks • /help - help
ru: ✅ Отлично! Ты успешно зарегистрирован! 📅 Дата рождения: %(birth_date)s 🎂 Возраст: %(age)s лет 📊 Прожито недель: %(weeks_lived)s ⏳ Осталось недель: %(remaining_weeks)s 📈 Прогресс жизни: %(life_percentage)s Теперь ты можешь использовать команды: • /weeks - показать недели жизни • /visualize - визуализация недель • /help - справка

# registration.error
source: ❌ An error occurred during registration. Try again or contact the administrator.
ru: ❌ Произошла ошибка при регистрации. Попробуй еще раз или обратись к администратору.

# birth_date.future_error
source: ❌ Birth date cannot be in the future! Please enter a valid date in DD.MM.YYYY format
ru: ❌ Дата рождения не может быть в будущем! Пожалуйста, введи корректную дату в формате ДД.ММ.ГГГГ

# birth_date.old_error
source: ❌ Birth date is too old! Please enter a valid date in DD.MM.YYYY format
ru: ❌ Дата рождения слишком старая! Пожалуйста, введи корректную дату в формате ДД.ММ.ГГГГ

# birth_date.format_error
source: ❌ Invalid date format! Please enter date in DD.MM.YYYY format For example: 15.03.1990
ru: ❌ Неверный формат даты! Пожалуйста, введи дату в формате ДД.ММ.ГГГГ Например: 15.03.1990

# subscription.already_active
source: ℹ️ You already have an active <b>{subscription_type}</b> subscription
ru: ℹ️ У вас уже активна подписка <b>{subscription_type}</b>

# subscription.change_success
source: ✅ <b>Subscription successfully changed!</b> New subscription: <b>{subscription_type}</b> {subscription_description} Changes took effect immediately.
ru: ✅ <b>Подписка успешно изменена!</b> Новая подписка: <b>{subscription_type}</b> {subscription_description} Изменения вступили в силу немедленно.

# subscription.change_failed
source: ❌ Failed to change subscription. Please try again later.
ru: ❌ Не удалось изменить подписку. Пожалуйста, попробуйте позже.

# subscription.change_error
source: ❌ An error occurred while changing subscription
ru: ❌ Произошла ошибка при изменении подписки

# settings.basic
source: ⚙️ <b>Profile Settings (Basic Subscription)</b> 📅 <b>Birth date:</b> {birth_date} 🌍 <b>Language:</b> {language_name} ⏰ <b>Expected life expectancy:</b> {life_expectancy} years Select what you want to change:
ru: ⚙️ <b>Настройки профиля (Базовая подписка)</b> 📅 <b>Дата рождения:</b> {birth_date} 🌍 <b>Язык:</b> {language_name} ⏰ <b>Ожидаемая продолжительность жизни:</b> {life_expectancy} лет Выберите, что хотите изменить:

# settings.premium
source: ⚙️ <b>Profile Settings (Premium Subscription)</b> 📅 <b>Birth date:</b> {birth_date} 🌍 <b>Language:</b> {language_name} ⏰ <b>Expected life expectancy:</b> {life_expectancy} years Select what you want to change:
ru: ⚙️ <b>Настройки профиля (Премиум подписка)</b> 📅 <b>Дата рождения:</b> {birth_date} 🌍 <b>Язык:</b> {language_name} ⏰ <b>Ожидаемая продолжительность жизни:</b> {life_expectancy} лет Выберите, что хотите изменить:

# settings.error
source: ❌ An error occurred while updating settings. Please try again later or contact the administrator.
ru: ❌ Произошла ошибка при обновлении настроек. Пожалуйста, попробуйте позже или обратитесь к администратору.

# settings.language_updated
source: ✅ <b>Language successfully changed!</b> New language: <b>{new_language}</b> All bot messages will now be in the selected language
ru: ✅ <b>Язык успешно изменён!</b> Новый язык: <b>{new_language}</b> Все сообщения бота теперь будут на выбранном языке

# buttons.change_birth_date
source: 📅 Change birth date
ru: 📅 Изменить дату рождения

# buttons.change_language
source: 🌍 Change language
ru: 🌍 Изменить язык

# buttons.change_life_expectancy
source: ⏰ Change life expectancy
ru: ⏰ Изменить ожидаемую продолжительность жизни

# weeks.statistics
source: 📊 <b>Your life statistics:</b> 🎂 <b>Age:</b> %(age)s years 📅 <b>Weeks lived:</b> %(weeks_lived)s ⏳ <b>Remaining weeks (until 80 years):</b> %(remaining_weeks)s 📈 <b>Life progress:</b> %(life_percentage)s 🎉 <b>Days until birthday:</b> %(days_until_birthday)s 💡 Use /visualize to visualize your life weeks
ru: 📊 <b>Ваша статистика жизни:</b> 🎂 <b>Возраст:</b> %(age)s лет 📅 <b>Прожито недель:</b> %(weeks_lived)s ⏳ <b>Осталось недель (до 80 лет):</b> %(remaining_weeks)s 📈 <b>Прогресс жизни:</b> %(life_percentage)s 🎉 <b>Дней до дня рождения:</b> %(days_until_birthday)s 💡 Используйте /visualize для визуализации ваших недель

# visualize.info
source: 📊 <b>Visualization of your life weeks</b> 🎂 Age: %(age)s years 📅 Weeks lived: %(weeks_lived)s 📈 Life progress: %(life_percentage)s 🟩 Green cells = weeks lived ⬜ White cells = future weeks
ru: 📊 <b>Визуализация ваших недель жизни</b> 🎂 Возраст: %(age)s лет 📅 Прожито недель: %(weeks_lived)s 📈 Прогресс жизни: %(life_percentage)s 🟩 Зеленые клетки = прожитые недели ⬜ Белые клетки = будущие недели

# visualize.legend
source: 🟩 Lived weeks | ⬜ Future weeks
ru: 🟩 Прожитые недели | ⬜ Будущие недели

source: visualize.legend
ru: 🟩 Прожитые недели | ⬜ Будущие недели

# unknown.command
source: ❌ Error: Unknown command or message. Use /help to get a list of available commands.
ru: ❌ Ошибка: Неизвестная команда или сообщение. Используйте /help для получения списка доступных команд.

# subscription.management
source: 🔐 <b>Subscription Management</b> Current subscription: <b>{subscription_type}</b> {subscription_description} Select new subscription type:
ru: 🔐 <b>Управление подпиской</b> Текущая подписка: <b>{subscription_type}</b> {subscription_description} Выберите новый тип подписки:

# subscription.basic_info
source: 💡 <b>Basic Subscription</b> You are using the basic version of the bot with core functionality. 🔗 <b>Support the project:</b> • GitHub: https://github.com/your-project/lifeweeks-bot • Donate: {buymeacoffee_url} Your support helps develop the bot! 🙏
ru: 💡 <b>Базовая подписка</b> Вы используете базовую версию бота с основной функциональностью. 🔗 <b>Поддержать проект:</b> • GitHub: https://github.com/your-project/lifeweeks-bot • Донат: {buymeacoffee_url} Ваша поддержка помогает развивать бота! 🙏

# subscription.premium_content
source: ✨ <b>Premium Content</b> 🧠 <b>Psychology of Time:</b> Research shows that time visualization helps make more conscious decisions. When we see the limitation of our weeks, we begin to value each one. 📊 <b>Interesting Facts:</b> • Average person spends 26 years sleeping (about 1,352 weeks) • 11 years working (572 weeks) • 5 years eating and cooking (260 weeks) • 4 years commuting (208 weeks) 🎯 <b>Daily Tip:</b> Try doing something new every week - it will help make life more fulfilling and memorable!
ru: ✨ <b>Премиум контент</b> 🧠 <b>Психология времени:</b> Исследования показывают, что визуализация времени помогает принимать более осознанные решения. Когда мы видим ограниченность наших недель, мы начинаем ценить каждую из них. 📊 <b>Интересные факты:</b> • Средний человек проводит 26 лет во сне (около 1,352 недель) • 11 лет работая (572 недели) • 5 лет едя и готовя (260 недель) • 4 года в дороге (208 недель) 🎯 <b>Совет дня:</b> Попробуйте делать что-то новое каждую неделю - это поможет сделать жизнь более насыщенной и запоминающейся!

# settings.change_birth_date
source: 📅 <b>Change Birth Date</b> Current date: <b>{current_birth_date}</b> Enter new birth date in DD.MM.YYYY format For example: 15.03.1990 Or press /cancel to cancel
ru: 📅 <b>Изменить дату рождения</b> Текущая дата: <b>{current_birth_date}</b> Введите новую дату рождения в формате ДД.ММ.ГГГГ Например: 15.03.1990 Или нажмите /cancel для отмены

# settings.birth_date_updated
source: ✅ <b>Birth date successfully updated!</b> New date: <b>{new_birth_date}</b> New age: <b>{new_age} years</b> Use /weeks to see updated statistics
ru: ✅ <b>Дата рождения успешно обновлена!</b> Новая дата: <b>{new_birth_date}</b> Новый возраст: <b>{new_age} лет</b> Используйте /weeks чтобы посмотреть обновленную статистику

# cancel.success
source: ✅ %(first_name)s, all your data has been successfully deleted. Use /start for re-registration.
ru: ✅ %(first_name)s, все ваши данные были успешно удалены. Используйте /start для повторной регистрации.

# cancel.error
source: ❌ An error occurred while deleting your data. Please try again or contact the administrator.
ru: ❌ Произошла ошибка при удалении ваших данных. Попробуйте еще раз или обратитесь к администратору.

# settings.change_life_expectancy
source: ⏰ <b>Change Expected Life Expectancy</b> Current value: <b>{current_life_expectancy} years</b> Enter new value (from 50 to 120 years):
ru: ⏰ <b>Изменить ожидаемую продолжительность жизни</b> Текущее значение: <b>{current_life_expectancy} лет</b> Введите новое значение (от 50 до 120 лет):

# settings.life_expectancy_updated
source: ✅ <b>Expected life expectancy updated!</b> New value: <b>{new_life_expectancy} years</b> Use /weeks to see updated statistics
ru: ✅ <b>Ожидаемая продолжительность жизни обновлена!</b> Новое значение: <b>{new_life_expectancy} лет</b> Используйте /weeks чтобы посмотреть обновленную статистику

# common.not_registered
source: ❌ Please register using /start
ru: ❌ Пожалуйста, зарегистрируйтесь с помощью /start

source: Not set
ru: Не установлено

# settings.invalid_life_expectancy
source: ❌ Invalid life expectancy. Please enter a value between 50 and 120 years.
ru: ❌ Неверная продолжительность жизни. Пожалуйста, введите значение от 50 до 120 лет.

# settings.change_language
source: 🌍 Select your preferred language
ru: 🌍 Выберите предпочитаемый язык
