Repository: akhmialeuski/telegram_myweeks_life_bot
Catalog: locales/ua/LC_MESSAGES/messages.po
Languages: ua

# help.text
source: 🤖 LifeWeeksBot - Helps you track the weeks of your life 📋 Available commands: • /start - Registration and settings • /weeks - Show life weeks • /visualize - Visualize life weeks • /settings - Settings • /subscription - Subscription • /help - This help 💡 Fun facts: • There are 52 weeks in a year • Average life expectancy: 80 years • That's about 4,160 weeks 🎯 The goal of the bot is to help you realize the value of time!
ua: 🤖 LifeWeeksBot - Допомагає відстежувати тижні твого життя 📋 Доступні команди: • /start - Реєстрація та налаштування • /weeks - Показати тижні життя • /visualize - Візуалізація тижнів життя • /settings - Налаштування • /subscription - Підписка • /help - Ця довідка 💡 Цікаві факти: • У році 52 тижні • Середня тривалість життя: 80 років • Це приблизно 4,160 тижнів 🎯 Мета бота - допомогти тобі усвідомити цінність часу!

# start.welcome_existing
source: 👋 Hello, %(first_name)s! Welcome back to LifeWeeksBot! You are already registered and ready to track your life weeks. Use /weeks to view your life weeks. Use /help for help.
ua: 👋 Привіт, %(first_name)s! Ласкаво просимо до LifeWeeksBot! Ти вже зареєстрований і готовий відстежувати свої тижні життя. Використовуй /weeks щоб подивитися свої тижні життя. Використовуй /help для довідки.

# start.welcome_new
source: 👋 Hello, %(first_name)s! Welcome to LifeWeeksBot! This bot will help you track the weeks of your life. 📅 Please enter your birth date in DD.MM.YYYY format For example: 15.03.1990
ua: 👋 Привіт, %(first_name)s! Ласкаво просимо до LifeWeeksBot! Цей бот допоможе тобі відстежувати тижні твого життя. 📅 Будь ласка, введи свою дату народження у форматі ДД.ММ.РРРР Наприклад: 15.03.1990

# registration.success
source: ✅ Great! You have successfully registered! 📅 Birth date: %(birth_date)s 🎂 Age: %(age)s years 📊 Weeks lived: %(weeks_lived)s ⏳ Remaining weeks: %(remaining_weeks)s 📈 Life progress: %(life_percentage)s Now you can use commands: • /weeks - show life weeks • /visualize - visualize weeks • /help - help
ua: ✅ Відмінно! Ти успішно зареєстрований! 📅 Дата народження: %(birth_date)s 🎂 Вік: %(age)s років 📊 Тижнів прожито: %(weeks_lived)s ⏳ Залишилося тижнів: %(remaining_weeks)s 📈 Прогрес життя: %(life_percentage)s Тепер ти можеш використовувати команди: • /weeks - показати тижні життя • /visualize - візуалізація тижнів • /help - довідка

# registration.error
source: ❌ An error occurred during registration. Try again or contact the administrator.
ua: ❌ Сталася помилка при реєстрації. Спробуй ще раз або звернися до адміністратора.

# birth_date.future_error
source: ❌ Birth date cannot be in the future! Please enter a valid date in DD.MM.YYYY format
ua: ❌ Дата народження не може бути в майбутньому! Будь ласка, введи коректну дату у форматі ДД.ММ.РРРР

# birth_date.old_error
source: ❌ Birth date is too old! Please enter a valid date in DD.MM.YYYY format
ua: ❌ Дата народження занадто стара! Будь ласка, введи коректну дату у форматі ДД.ММ.РРРР

# birth_date.format_error
source: ❌ Invalid date format! Please enter date in DD.MM.YYYY format For example: 15.03.1990
ua: ❌ Невірний формат дати! Будь ласка, введи дату у форматі ДД.ММ.РРРР Наприклад: 15.03.1990

# subscription.already_active
source: ℹ️ You already have an active <b>{subscription_type}</b> subscription
ua: ℹ️ У вас вже активна підписка <b>{subscription_type}</b>

# subscription.change_success
source: ✅ <b>Subscription successfully changed!</b> New subscription: <b>{subscription_type}</b> {subscription_description} Changes took effect immediately.
ua: ✅ <b>Підписку успішно змінено!</b> Нова підписка: <b>{subscription_type}</b> {subscription_description} Зміни набули чинності негайно.

# subscription.change_failed
source: ❌ Failed to change subscription. Please try again later.
ua: ❌ Не вдалося змінити підписку. Спробуйте пізніше.

# subscription.change_error
source: ❌ An error occurred while changing subscription
ua: ❌ Сталася помилка при зміні підписки

# settings.basic
source: ⚙️ <b>Profile Settings (Basic Subscription)</b> 📅 <b>Birth date:</b> {birth_date} 🌍 <b>Language:</b> {language_name} ⏰ <b>Expected life expectancy:</b> {life_expectancy} years Select what you want to change:
ua: ⚙️ <b>Налаштування профілю (Базова підписка)</b> 📅 <b>Дата народження:</b> {birth_date} 🌍 <b>Мова:</b> {language_name} ⏰ <b>Очікувана тривалість життя:</b> {life_expectancy} років Оберіть, що хочете змінити:

# settings.premium
source: ⚙️ <b>Profile Settings (Premium Subscription)</b> 📅 <b>Birth date:</b> {birth_date} 🌍 <b>Language:</b> {language_name} ⏰ <b>Expected life expectancy:</b> {life_expectancy} years Select what you want to change:
ua: ⚙️ <b>Налаштування профілю (Преміум підписка)</b> 📅 <b>Дата народження:</b> {birth_date} 🌍 <b>Мова:</b> {language_name} ⏰ <b>Очікувана тривалість життя:</b> {life_expectancy} років Оберіть, що хочете змінити:

# settings.error
source: ❌ An error occurred while updating settings. Please try again later or contact the administrator.
ua: ❌ Сталася помилка при оновленні налаштувань. Спробуйте пізніше або зверніться до адміністратора.

# settings.language_updated
source: ✅ <b>Language successfully changed!</b> New language: <b>{new_language}</b> All bot messages will now be in the selected language
ua: ✅ <b>Мову успішно змінено!</b> Нова мова: <b>{new_language}</b> Всі повідомлення бота тепер будуть обраною мовою

# buttons.change_birth_date
source: 📅 Change birth date
ua: 📅 Змінити дату народження

# buttons.change_language
source: 🌍 Change language
ua: 🌍 Змінити мову

# buttons.change_life_expectancy
source: ⏰ Change life expectancy
ua: ⏰ Змінити очікувану тривалість життя

# weeks.statistics
source: 📊 <b>Your life statistics:</b> 🎂 <b>Age:</b> %(age)s years 📅 <b>Weeks lived:</b> %(weeks_lived)s ⏳ <b>Remaining weeks (until 80 years):</b> %(remaining_weeks)s 📈 <b>Life progress:</b> %(life_percentage)s 🎉 <b>Days until birthday:</b> %(days_until_birthday)s 💡 Use /visualize to visualize your life weeks
ua: 📊 <b>Ваша статистика життя:</b> 🎂 <b>Вік:</b> %(age)s років 📅 <b>Прожито тижнів:</b> %(weeks_lived)s ⏳ <b>Залишилося тижнів (до 80 років):</b> %(remaining_weeks)s 📈 <b>Прогрес життя:</b> %(life_percentage)s 🎉 <b>Днів до дня народження:</b> %(days_until_birthday)s 💡 Використовуйте /visualize для візуалізації ваших тижнів

# visualize.info
source: 📊 <b>Visualization of your life weeks</b> 🎂 Age: %(age)s years 📅 Weeks lived: %(weeks_lived)s 📈 Life progress: %(life_percentage)s 🟩 Green cells = weeks lived ⬜ White cells = future weeks
ua: 📊 <b>Візуалізація ваших тижнів життя</b> 🎂 Вік: %(age)s років 📅 Прожито тижнів: %(weeks_lived)s 📈 Прогрес життя: %(life_percentage)s 🟩 Зелені клітинки = прожиті тижні ⬜ Білі клітинки = майбутні тижні

# visualize.legend
source: 🟩 Lived weeks | ⬜ Future weeks
ua: 🟩 Прожиті тижні | ⬜ Майбутні тижні

source: visualize.legend
ua: 🟩 Прожиті тижні | ⬜ Майбутні тижні

# unknown.command
source: ❌ Error: Unknown command or message. Use /help to get a list of available commands.
ua: ❌ Помилка: Невідома команда або повідомлення. Використовуйте /help для отримання списку доступних команд.

# subscription.management
source: 🔐 <b>Subscription Management</b> Current subscription: <b>{subscription_type}</b> {subscription_description} Select new subscription type:
ua: 🔐 <b>Управління підпискою</b> Поточна підписка: <b>{subscription_type}</b> {subscription_description} Оберіть новий тип підписки:

# subscription.basic_info
source: 💡 <b>Basic Subscription</b> You are using the basic version of the bot with core functionality. 🔗 <b>Support the project:</b> • GitHub: https://github.com/your-project/lifeweeks-bot • Donate: {buymeacoffee_url} Your support helps develop the bot! 🙏
ua: 💡 <b>Базова підписка</b> Ви використовуєте базову версію бота з основною функціональністю. 🔗 <b>Підтримати проект:</b> • GitHub: https://github.com/your-project/lifeweeks-bot • Донат: {buymeacoffee_url} Ваша підтримка допомагає розвивати бота! 🙏

# subscription.premium_content
source: ✨ <b>Premium Content</b> 🧠 <b>Psychology of Time:</b> Research shows that time visualization helps make more conscious decisions. When we see the limitation of our weeks, we begin to value each one. 📊 <b>Interesting Facts:</b> • Average person spends 26 years sleeping (about 1,352 weeks) • 11 years working (572 weeks) • 5 years eating and cooking (260 weeks) • 4 years commuting (208 weeks) 🎯 <b>Daily Tip:</b> Try doing something new every week - it will help make life more fulfilling and memorable!
ua: ✨ <b>Преміум контент</b> 🧠 <b>Психологія часу:</b> Дослідження показують, що візуалізація часу допомагає приймати більш свідомі рішення. Коли ми бачимо обмеженість наших тижнів, ми починаємо цінувати кожен з них. 📊 <b>Цікаві факти:</b> • Середня людина проводить 26 років у сні (близько 1,352 тижнів) • 11 років працюючи (572 тижні) • 5 років їдячи та готуючи (260 тижнів) • 4 роки в дорозі (208 тижнів) 🎯 <b>Порада дня:</b> Спробуйте робити щось нове кожного тижня - це допоможе зробити життя більш насиченим та запам'ятовуваним!

# settings.change_birth_date
source: 📅 <b>Change Birth Date</b> Current date: <b>{current_birth_date}</b> Enter new birth date in DD.MM.YYYY format For example: 15.03.1990 Or press /cancel to cancel
ua: 📅 <b>Змінити дату народження</b> Поточна дата: <b>{current_birth_date}</b> Введіть нову дату народження у форматі ДД.ММ.РРРР Наприклад: 15.03.1990 Або натисніть /cancel для скасування

# settings.birth_date_updated
source: ✅ <b>Birth date successfully updated!</b> New date: <b>{new_birth_date}</b> New age: <b>{new_age} years</b> Use /weeks to see updated statistics
ua: ✅ <b>Дату народження успішно оновлено!</b> Нова дата: <b>{new_birth_date}</b> Новий вік: <b>{new_age} років</b> Використовуйте /weeks щоб подивитися оновлену статистику

# cancel.success
source: ✅ %(first_name)s, all your data has been successfully deleted. Use /start for re-registration.
ua: ✅ %(first_name)s, всі ваші дані були успішно видалені. Використовуйте /start для повторної реєстрації.

# cancel.error
source: ❌ An error occurred while deleting your data. Please try again or contact the administrator.
ua: ❌ Сталася помилка при видаленні ваших даних. Спробуйте ще раз або зверніться до адміністратора.

# settings.change_life_expectancy
source: ⏰ <b>Change Expected Life Expectancy</b> Current value: <b>{current_life_expectancy} years</b> Enter new value (from 50 to 120 years):
ua: ⏰ <b>Змінити очікувану тривалість життя</b> Поточне значення: <b>{current_life_expectancy} років</b> Введіть нове значення (від 50 до 120 років):

# settings.life_expectancy_updated
source: ✅ <b>Expected life expectancy updated!</b> New value: <b>{new_life_expectancy} years</b> Use /weeks to see updated statistics
ua: ✅ <b>Очікувану тривалість життя оновлено!</b> Нове значення: <b>{new_life_expectancy} років</b> Використовуйте /weeks щоб подивитися оновлену статистику

# common.not_registered
source: ❌ Please register using /start
ua: ❌ Будь ласка, зареєструйтесь за допомогою /start

source: Not set
ua: Не встановлено

# settings.invalid_life_expectancy
source: ❌ Invalid life expectancy. Please enter a value between 50 and 120 years.
ua: ❌ Невірна тривалість життя. Будь ласка, введіть значення від 50 до 120 років.

# settings.change_language
source: 🌍 Select your preferred language
ua: 🌍 Виберіть бажану мову
