Repository: akhmialeuski/telegram_myweeks_life_bot
Catalog: locales/by/LC_MESSAGES/messages.po
Languages: by

# help.text
source: 🤖 LifeWeeksBot - Helps you track the weeks of your life 📋 Available commands: • /start - Registration and settings • /weeks - Show life weeks • /visualize - Visualize life weeks • /settings - Settings • /subscription - Subscription • /help - This help 💡 Fun facts: • There are 52 weeks in a year • Average life expectancy: 80 years • That's about 4,160 weeks 🎯 The goal of the bot is to help you realize the value of time!
by: 🤖 LifeWeeksBot - Дапамагае адсочваць тыдні твайго жыцця 📋 Даступныя каманды: • /start - Рэгістрацыя і наладжванне • /weeks - Паказаць тыдні жыцця • /visualize - Візуалізацыя тыдняў жыцця • /settings - Налады • /subscription - Падпіска • /help - Гэта даведка 💡 Цікавыя факты: • У годзе 52 тыдні • Сярэдняя працягласць жыцця: 80 гадоў • Гэта прыблізна 4,160 тыдняў 🎯 Мэта бота - дапамагчы табе ўсвядоміць каштоўнасць часу!

# start.welcome_existing
source: 👋 Hello, %(first_name)s! Welcome back to LifeWeeksBot! You are already registered and ready to track your life weeks. Use /weeks to view your life weeks. Use /help for help.
by: 👋 Прывітанне, %(first_name)s! Сардэчна запрашаем назад у LifeWeeksBot! Ты ўжо зарэгістраваны і гатовы адсочваць тыдні свайго жыцця. Выкарыстоўвай /weeks каб паглядзець тыдні жыцця. Выкарыстоўвай /help для даведкі.

# start.welcome_new
source: 👋 Hello, %(first_name)s! Welcome to LifeWeeksBot! This bot will help you track the weeks of your life. 📅 Please enter your birth date in DD.MM.YYYY format For example: 15.03.1990
by: 👋 Прывітанне, %(first_name)s! Сардэчна запрашаем у LifeWeeksBot! Гэты бот дапаможа табе адсочваць тыдні твайго жыцця. 📅 Калі ласка, увядзі дату нараджэння ў фармаце ДД.ММ.ГГГГ Напрыклад: 15.03.1990

# registration.success
source: ✅ Great! You have successfully registered! 📅 Birth date: %(birth_date)s 🎂 Age: %(age)s years 📊 Weeks lived: %(weeks_lived)s ⏳ Remaining weeks: %(remaining_weeks)s 📈 Life progress: %(life_percentage)s Now you can use commands: • /weeks - show life weeks • /visualize - visualize weeks • /help - help
by: ✅ Выдатна! Ты паспяхова зарэгістраваны! 📅 Дата нараджэння: %(birth_date)s 🎂 Узрост: %(age)s гадоў 📊 Тыдняў пражыта: %(weeks_lived)s ⏳ Засталося тыдняў: %(remaining_weeks)s 📈 Прагрэс жыцця: %(life_percentage)s Цяпер ты можаш выкарыстоўваць каманды: • /weeks - паказаць тыдні жыцця • /visualize - візуалізацыя тыдняў • /help - даведка

# registration.error
source: ❌ An error occurred during registration. Try again or contact the administrator.
by: ❌ Адбылася памылка пры рэгістрацыі. Паспрабуй яшчэ раз або звярніся да адміністратара.

# birth_date.future_error
source: ❌ Birth date cannot be in the future! Please enter a valid date in DD.MM.YYYY format
by: ❌ Дата нараджэння не можа быць у будучыні! Калі ласка, увядзі карэктную дату ў фармаце ДД.ММ.ГГГГ

# birth_date.old_error
source: ❌ Birth date is too old! Please enter a valid date in DD.MM.YYYY format
by: ❌ Дата нараджэння занадта старая! Калі ласка, увядзі карэктную дату ў фармаце ДД.ММ.ГГГГ

# birth_date.format_error
source: ❌ Invalid date format! Please enter date in DD.MM.YYYY format For example: 15.03.1990
by: ❌ Няправільны фармат даты! Калі ласка, увядзі дату ў фармаце ДД.ММ.ГГГГ Напрыклад: 15.03.1990

# subscription.already_active
source: ℹ️ You already have an active <b>{subscription_type}</b> subscription
by: ℹ️ У вас ужо актыўная падпіска <b>{subscription_type}</b>

# subscription.change_success
source: ✅ <b>Subscription successfully changed!</b> New subscription: <b>{subscription_type}</b> {subscription_description} Changes took effect immediately.
by: ✅ <b>Падпіска паспяхова зменена!</b> Новая падпіска: <b>{subscription_type}</b> {subscription_description} Змены ўступілі ў сілу неадкладна.

# subscription.change_failed
source: ❌ Failed to change subscription. Please try again later.
by: ❌ Не ўдалося змяніць падпіску. Паспрабуйце пазней.

# subscription.change_error
source: ❌ An error occurred while changing subscription
by: ❌ Адбылася памылка пры змене падпіскі

# settings.basic
source: ⚙️ <b>Profile Settings (Basic Subscription)</b> 📅 <b>Birth date:</b> {birth_date} 🌍 <b>Language:</b> {language_name} ⏰ <b>Expected life expectancy:</b> {life_expectancy} years Select what you want to change:
by: ⚙️ <b>Налады профілю (Базавая падпіска)</b> 📅 <b>Дата нараджэння:</b> {birth_date} 🌍 <b>Мова:</b> {language_name} ⏰ <b>Чаканая працягласць жыцця:</b> {life_expectancy} гадоў Выберыце, што хочаце змяніць:

# settings.premium
source: ⚙️ <b>Profile Settings (Premium Subscription)</b> 📅 <b>Birth date:</b> {birth_date} 🌍 <b>Language:</b> {language_name} ⏰ <b>Expected life expectancy:</b> {life_expectancy} years Select what you want to change:
by: ⚙️ <b>Налады профілю (Прэміум падпіска)</b> 📅 <b>Дата нараджэння:</b> {birth_date} 🌍 <b>Мова:</b> {language_name} ⏰ <b>Чаканая працягласць жыцця:</b> {life_expectancy} гадоў Выберыце, што хочаце змяніць:

# settings.error
source: ❌ An error occurred while updating settings. Please try again later or contact the administrator.
by: ❌ Адбылася памылка пры абнаўленні налад. Паспрабуйце пазней або звярніцеся да адміністратара.

# settings.language_updated
source: ✅ <b>Language successfully changed!</b> New language: <b>{new_language}</b> All bot messages will now be in the selected language
by: ✅ <b>Мова паспяхова зменена!</b> Новая мова: <b>{new_language}</b> Усе паведамленні бота цяпер будуць на абранай мове

# buttons.change_birth_date
source: 📅 Change birth date
by: 📅 Змяніць дату нараджэння

# buttons.change_language
source: 🌍 Change language
by: 🌍 Змяніць мову

# buttons.change_life_expectancy
source: ⏰ Change life expectancy
by: ⏰ Змяніць чаканую працягласць жыцця

# weeks.statistics
source: 📊 <b>Your life statistics:</b> 🎂 <b>Age:</b> %(age)s years 📅 <b>Weeks lived:</b> %(weeks_lived)s ⏳ <b>Remaining weeks (until 80 years):</b> %(remaining_weeks)s 📈 <b>Life progress:</b> %(life_percentage)s 🎉 <b>Days until birthday:</b> %(days_until_birthday)s 💡 Use /visualize to visualize your life weeks
by: 📊 <b>Ваша статыстыка жыцця:</b> 🎂 <b>Узрост:</b> %(age)s гадоў 📅 <b>Пражыта тыдняў:</b> %(weeks_lived)s ⏳ <b>Засталося тыдняў (да 80 гадоў):</b> %(remaining_weeks)s 📈 <b>Прагрэс жыцця:</b> %(life_percentage)s 🎉 <b>Дзён да дня нараджэння:</b> %(days_until_birthday)s 💡 Выкарыстоўвайце /visualize для візуалізацыі вашых тыдняў

# visualize.info
source: 📊 <b>Visualization of your life weeks</b> 🎂 Age: %(age)s years 📅 Weeks lived: %(weeks_lived)s 📈 Life progress: %(life_percentage)s 🟩 Green cells = weeks lived ⬜ White cells = future weeks
by: 📊 <b>Візуалізацыя вашых тыдняў жыцця</b> 🎂 Узрост: %(age)s гадоў 📅 Пражыта тыдняў: %(weeks_lived)s 📈 Прагрэс жыцця: %(life_percentage)s 🟩 Зялёныя клеткі = пражытыя тыдні ⬜ Белыя клеткі = будучыя тыдні

# visualize.legend
source: 🟩 Lived weeks | ⬜ Future weeks
by: 🟩 Пражытыя тыдні | ⬜ Будучыя тыдні

source: visualize.legend
by: 🟩 Пражытыя тыдні | ⬜ Будучыя тыдні

# unknown.command
source: ❌ Error: Unknown command or message. Use /help to get a list of available commands.
by: ❌ Памылка: Невядомая каманда або паведамленне. Выкарыстоўвайце /help для атрымання спісу даступных каманд.

# subscription.management
source: 🔐 <b>Subscription Management</b> Current subscription: <b>{subscription_type}</b> {subscription_description} Select new subscription type:
by: 🔐 <b>Кіраванне падпіскай</b> Бягучая падпіска: <b>{subscription_type}</b> {subscription_description} Выберыце новы тып падпіскі:

# subscription.basic_info
source: 💡 <b>Basic Subscription</b> You are using the basic version of the bot with core functionality. 🔗 <b>Support the project:</b> • GitHub: https://github.com/your-project/lifeweeks-bot • Donate: {buymeacoffee_url} Your support helps develop the bot! 🙏
by: 💡 <b>Базавая падпіска</b> Вы выкарыстоўваеце базавую версію бота з асноўнай функцыянальнасцю. 🔗 <b>Падтрымаць праект:</b> • GitHub: https://github.com/your-project/lifeweeks-bot • Данат: {buymeacoffee_url} Ваша падтрымка дапамагае развіваць бота! 🙏

# subscription.premium_content
source: ✨ <b>Premium Content</b> 🧠 <b>Psychology of Time:</b> Research shows that time visualization helps make more conscious decisions. When we see the limitation of our weeks, we begin to value each one. 📊 <b>Interesting Facts:</b> • Average person spends 26 years sleeping (about 1,352 weeks) • 11 years working (572 weeks) • 5 years eating and cooking (260 weeks) • 4 years commuting (208 weeks) 🎯 <b>Daily Tip:</b> Try doing something new every week - it will help make life more fulfilling and memorable!
by: ✨ <b>Прэміум кантент</b> 🧠 <b>Псіхалогія часу:</b> Даследаванні паказваюць, што візуалізацыя часу дапамагае прымаць больш свядомасныя рашэнні. Калі мы бачым абмежаванасць нашых тыдняў, мы пачынаем цаніць кожны з іх. 📊 <b>Цікавыя факты:</b> • Сярэдні чалавек праводзіць 26 гадоў у сне (каля 1,352 тыдняў) • 11 гадоў працуючы (572 тыдні) • 5 гадоў ядучы і гатуючы (260 тыдняў) • 4 гады ў дарозе (208 тыдняў) 🎯 <b>Парада дня:</b> Паспрабуйце рабіць што-то новае кожны тыдзень - гэта дапаможа зрабіць жыццё больш насычаным і запамінальным!

# settings.change_birth_date
source: 📅 <b>Change Birth Date</b> Current date: <b>{current_birth_date}</b> Enter new birth date in DD.MM.YYYY format For example: 15.03.1990 Or press /cancel to cancel
by: 📅 <b>Змяніць дату нараджэння</b> Бягучая дата: <b>{current_birth_date}</b> Увядзіце новую дату нараджэння ў фармаце ДД.ММ.ГГГГ Напрыклад: 15.03.1990 Або націсніце /cancel для адмены

# settings.birth_date_updated
source: ✅ <b>Birth date successfully updated!</b> New date: <b>{new_birth_date}</b> New age: <b>{new_age} years</b> Use /weeks to see updated statistics
by: ✅ <b>Дата нараджэння паспяхова абноўлена!</b> Новая дата: <b>{new_birth_date}</b> Новы ўзрост: <b>{new_age} гадоў</b> Выкарыстоўвайце /weeks каб паглядзець абноўленую статыстыку

# cancel.success
source: ✅ %(first_name)s, all your data has been successfully deleted. Use /start for re-registration.
by: ✅ %(first_name)s, усе вашы даныя былі паспяхова выдаленыя. Выкарыстоўвайце /start для паўторнай рэгістрацыі.

# cancel.error
source: ❌ An error occurred while deleting your data. Please try again or contact the administrator.
by: ❌ Адбылася памылка пры выдаленні вашых даных. Паспрабуйце яшчэ раз або звярніцеся да адміністратара.

# settings.change_life_expectancy
source: ⏰ <b>Change Expected Life Expectancy</b> Current value: <b>{current_life_expectancy} years</b> Enter new value (from 50 to 120 years):
by: ⏰ <b>Змяніць чаканую працягласць жыцця</b> Бягучае значэнне: <b>{current_life_expectancy} гадоў</b> Увядзіце новае значэнне (ад 50 да 120 гадоў):

# settings.life_expectancy_updated
source: ✅ <b>Expected life expectancy updated!</b> New value: <b>{new_life_expectancy} years</b> Use /weeks to see updated statistics
by: ✅ <b>Чаканая працягласць жыцця абноўлена!</b> Новае значэнне: <b>{new_life_expectancy} гадоў</b> Выкарыстоўвайце /weeks каб паглядзець абноўленую статыстыку

# common.not_registered
source: ❌ Please register using /start
by: ❌ Калі ласка, зарэгіструйцеся з дапамогай /start

source: Not set
by: Не ўстаноўлена

# settings.invalid_life_expectancy
source: ❌ Invalid life expectancy. Please enter a value between 50 and 120 years.
by: ❌ Няправільная працягласць жыцця. Калі ласка, увядзіце значэнне ад 50 да 120 гадоў.

# settings.change_language
source: 🌍 Select your preferred language
by: 🌍 Выберыце пераважную мову
